id: 25b9c01c-350d-4b95-bed1-836d04a4f324
title: Cypress test rule
description: >-
  This is a rule used to test the rule creation workflow. Not for production
  use.
status: experimental
author: Cypress Test Runner
date: 2022/11/04
modified: 2022/11/04
logsource:
  category: windows
level: critical
detection:
  selection:
    Provider_Name: Service Control Manager
    EventID: 0
    ServiceName: ZzNetSvc
  condition: selection
tags:
  - attack.persistence
references:
  - 'https://nohello.com'
falsepositives:
  - unknown